# Taps
tap "hashicorp/tap"

# CLI Tools
brew "bat"              # Cat clone with syntax highlighting and Git integration
brew "cloud-sql-proxy"  # Cloud SQL Proxy for connecting to Cloud SQL instances
brew "fzf"              # Command-line fuzzy finder
brew "glow"             # Markdown renderer for the command line
brew "git"              # Distributed version control system
brew "git-lfs"          # Git extension for versioning large files
brew "gitu"             # Magit-like git interface for the command line
brew "htop"             # Interactive process viewer and system monitor
brew "jq"               # Lightweight command-line JSON processor
brew "micro"            # Modern and intuitive terminal-based text editor
brew "nvm"              # Node Version Manager for managing multiple Node.js versions
brew "readline"         # Library for command-line editing and history
brew "sqlite"           # Command-line interface for SQLite database
brew "hashicorp/tap/terraform"  # Infrastructure as code tool
brew "uv"               # Fast Python package installer and resolver
brew "wget"             # Tool for retrieving files using HTTP/HTTPS and FTP
brew "yazi"             # File manager for the command line
brew "zlib"             # Data compression library

# Currently Testing - Modern CLI replacements
brew "btop"             # htop replacement - beautiful resource monitor
brew "git-delta"         # git diff replacement - syntax highlighting, side-by-side
brew "eza"              # ls replacement - icons, git status, tree view
brew "fd"               # find replacement - simpler syntax, faster
brew "ripgrep"          # grep replacement - 10x faster, respects .gitignore
brew "tldr"             # man replacement - community-driven examples
brew "zoxide"           # cd replacement - learns your habits

# Applications
cask "1password"            # Password manager with GUI interface
cask "1password-cli"        # 1Password command line interface
cask "appcleaner"           # App uninstaller
cask "beekeeper-studio"     # SQL editor and database manager
cask "docker-desktop"       # Container platform for building and shipping apps
cask "focusrite-control-2"  # Focusrite audio interface control software
cask "ghostty"              # GPU-accelerated terminal emulator
cask "google-chrome"        # Web browser
cask "gcloud-cli"          # Google Cloud SDK tools
cask "imageoptim"           # Image optimizer
cask "kap"                  # Screen recorder with GIF support
cask "keepingyouawake"      # Prevent Mac from sleeping
cask "monitorcontrol"       # External display brightness control
cask "postman"              # API development and testing tool
cask "superwhisper"         # Audio transcription tool using Whisper AI
cask "the-unarchiver"       # Archive extraction utility
cask "vlc"                  # Media player
cask "zen"                  # Web browser

# Fonts
cask "font-fantasque-sans-mono"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-source-code-pro"

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
# cask "quicklook-json"
cask "webpquicklook"
